myinit.org
#+STARTUP: hidestars
* Notes
** TODO Planned Tweaks
   - [ ] understand company for python
   - [ ] Org Blog w/ [[https://ox-hugo.scripter.co/][ox-hugo]]. [[https://www.reddit.com/r/orgmode/comments/gcex8p/creating_a_blog_with_orgmode/][Reddit Post]]
     - [[https://timdams.com/][This]] blog does a good job organizing the way I'd like, but I'd like it to have a different home page
   - [ ] use yasnippet for inserting bable
   - [ ] move mode specific hotkeys from general to use-package
   - [ ] blacken for python mode
   - [ ] Remove annoying lisp warning and char number warnings for flycheck
   - [ ] Move org-files to dropbox ;; just dragging my feet ;; did note linkup but not gtd
   - [ ] don't delete scratch buffer zzamboni
   - [ ] learn about bookmarks
   - [ ] Figure out where & how windows knows where my emacs is
   - [ ] PDF-viewer ;; seems like a drag on windows. doc-viewer let's me at least see the text
   - [ ] hydra for [[https://github.com/abo-abo/hydra/wiki/Emacs][outline]]
   - [ ] fix ediff
   - [ ] add hooks more elegantly w/ general
   - [ ] babel installs (R)
   - [ ] [[http://www.cachestocaches.com/2017/3/complete-guide-email-emacs-using-mu-and-/][email]]
   - [ ] explore emacs-jupyter
   - [X] improve documentation of this file
   - [X] reduce start time [[https://www.reddit.com/r/emacs/comments/3kqt6e/2_easy_little_known_steps_to_speed_up_emacs_start/][1]] [[https://blog.d46.us/advanced-emacs-startup/][2]]
   - [X] Instead of 'catapult use when microsoft, so I don't need to update my config
   - [X] use ENTER to follow links -- just use C-c C-o
   - [X] Figure out pomodoro
   - [X] gitgutter
   - [X] [[https://github.com/bastibe/org-journal][org-journal]]
   - [X] Config Shackle (do I need to? I feel like I've been able to supress a lot as of late)
   - [X] Default new todo bullet to TODO not inprogress
   - [X] customize telephone line [[https://www.reddit.com/r/emacs/comments/7e7xzg/telephoneline_theming_question/][colors]] to match theme ;; Defaults look better than the starting custom
   - [X] ask about org-habit going away after tweaks ;; decided that It's not a big deal
   - [X] move scheduled to todo
   - [X] hydra for themes solved w/ counsel-load-file
   - [X] Fix Agenda
   - [X] [[https://www.reddit.com/r/emacs/comments/4n0n8o/what_is_the_best_emacs_mode_line_package/][some sort of mode line]]. [[https://github.com/dbordak/telephone-line][Telephone-line]] looks promising
   - [X] Tramp: Fix ivy "c:" problem, or just make custom function around it
   - [X] Custom paths
   - [X] figure out lispy (I just went w/ lispyville)
   - [X] Make sure next buffer and last buffer only do real files
   - [X] move w/ evil in agenda
   - [X] magit consider j and k 
   - [X] spell-fu ;; why not in melpa? aspell w/ wierd packman install
   - [X] make this an org file
   - [ ] vim bracket buffer movement
   - [ ] org make todotype selection easier
   - [ ] Treemacs (do I need this?) ;; no
   - [ ] Use [[https://github.com/alphapapa/org-super-agenda][org-super-agenda]]
   - [ ] ace by abo-abo? Probably more than I need right now
   - [ ] LSP instead of elpy ;; seems like too much of a headache
** Inspiration + links
   - [[https://www.youtube.com/watch?v=49kBWM3RQQ8&list=PL9KxKa8NpFxIcNQa9js7dQQIHc81b0-Xg&index=1][Using Emacs videos]]
   - Originally inspaired by based on [[https://huytd.github.io/emacs-from-scratch.html#orgf713fce][this]] implementation 
   - Kwrooijen's [[https://github.com/kwrooijen/.emacs.d/tree/40e0054b012814fd1550e3c6648af4a22e73df72][implmentation]]. Uses evil, use-package, and many abo-abo. 
   - Emacs Adventures [[https://github.com/amolgawai/emacsadventures/tree/92578a5b5bf71ccc7f2e1859edefaa97d8d51df1/config][robust emacs config]] 
   - [[https://sam217pa.github.io/2016/09/23/keybindings-strategies-in-emacs/][Key bindings article]]
   - [[https://blog.aaronbieber.com/2016/09/24/an-agenda-for-life-with-org-mode.html][Aaron Bieber]] the guy who convinced me to try Evil. I steal from his Agenda setup
   - [[https://github.com/angrybacon/dotemacs/blob/master/dotemacs.org][This one]] is beautiful. Found it when investigating mode lines
   - [[https://github.com/noahfrederick/dots/blob/master/emacs/emacs.org][Nox]] has an org set-up in his use-package
   - [[https://github.com/zzamboni/dot-emacs/blob/master/init.org][zzamboni]] has a great literate config. Lots of it considers writing
   - [[http://www.howardism.org/Technical/Emacs/orgmode-wordprocessor.html][This]] guy has a really robust emacs blog. He makes his org-mode look AWESOME. I'm not sure it's worth the effort though
   - I borrowed a lot of ideas from [[https://jamiecollinson.com/blog/my-emacs-config/][this]] one
    - [ ] w3m
    - [ ] writegood
    - [ ] customize org appearance
    - [ ] proselint
    - [X] gitgutter
    - [ ] gittimemachine
    - [X] rainbow delimiters
    - [ ] prettify symbols
    - [ ] get rid of ivy ^

* Performance Optimization
  This section entirely stolen from [[https://github.com/zzamboni/dot-emacs/blob/master/init.org#performance-optimization][here]].
  
  - [[https://www.reddit.com/r/emacs/comments/3kqt6e/2_easy_little_known_steps_to_speed_up_emacs_start/][Two easy little known steps to speed up Emacs start up time]]
  - [[https://blog.d46.us/advanced-emacs-startup/][Advanced Techniques for Reducing Emacs Startup Time]]
  
  Based on these, I have added the code below.

  First, we wrap the whole init file in a block that sets =file-name-handler-alist= to =nil= to prevent any special-filename parsing of files loaded from the init file (e.g. remote files loaded through tramp, etc.). The =let= block gets closed in the [[Epilogue][Epilogue]].
  
  #+begin_src emacs-lisp
    (let ((file-name-handler-alist nil))
  #+end_src

  Next, a hook that reports how long and how many garbage collections the startup took. We use a hook to run it at the very end, so the message doesn't get clobbered by other messages during startup.

  #+begin_src emacs-lisp
    (add-hook 'emacs-startup-hook
              (lambda ()
                (message "Emacs ready in %s with %d garbage collections."
                         (format "%.2f seconds"
                                 (float-time
                                  (time-subtract after-init-time before-init-time)))
                         gcs-done)))
  #+end_src

  Optionally enable =debug-on-error= - I do this only when I'm trying to figure out some problem in my config.

  #+begin_src emacs-lisp
    ;;(setq debug-on-error t)
  #+end_src

  If the =gcmh= package is already installed, load and enable it early. If not, this gets installed a bit later in the Package Management section. This package manages the garbage collection thresholds and scheduling to improve performance. DISABLED for now because it seems to cause performance degradation when inserting text in long files.

  #+begin_src emacs-lisp
    ;; (when (require 'gcmh nil t)
    ;;   (gcmh-mode 1))
  #+end_src

  We set =gc-cons-threshold= to its maximum value, to prevent any garbage collection from happening during load time. We also reset this value in the [[Epilogue][Epilogue]].

  #+begin_src emacs-lisp
    (setq gc-cons-threshold most-positive-fixnum)
  #+end_src

  Using all of this, my startup time went from 21 seconds down to 15 seconds.

* Setup
** Paths
   I use multiple computers. This allows me to update paths globally for each of my machines.
 #+begin_src emacs-lisp
   (setq workstation 'catapult) ;; options: catapult, personal_macbook

   (setq user-full-name "Andrew Kraemer")
   (setq user-mail-address "andrew.h.kraemer@gmail.com")

   (cond ((eq window-system 'w32)
	  (setq ak/custpath-home "c:/Users/akraemer/"
		ak/custpath-dropbox-org "c:/Users/akraemer/Dropbox/org/"
		ak/custpath-phone-notes "c:/Users/akraemer/Dropbox/org/phone_inbox.org"
		ak/custpath-journal-path "c:/Users/akraemer/Dropbox/journal/"
		ak/custpath-emacsd "c:/emacs/.emacs.d/"
		ak/custpath-org-notes "c:/emacs/notes/"
		ak/custpath-py-default-env "c:/Users/akraemer/Anaconda3/envs/py37"
		ak/custpath-flake8 "c:/Users/akraemer/Anaconda3/Scripts/flake8.exe"
		ak/custpath-aspell "c:/msys64/mingw64/bin/aspell.exe"))
	 ((eq window-system 'ns)
	  (setq ak/custpath-home "/Users/AndrewKraemer/"
		ak/custpath-dropbox-org "/Users/AndrewKraemer/Dropbox/org/"
		ak/custpath-phone-notes "/Users/AndrewKraemer/Dropbox/org/phone_inbox.org"
		ak/custpath-journal-path "/Users/AndrewKraemer/Dropbox/journal/"
		ak/custpath-emacsd "~/.emacs.d/"
		ak/custpath-org-notes "~/emacs/notes/"
		ak/custpath-py-default-env "/Users/AndrewKraemer/anaconda3/envs/py37"
		ak/custpath-aspell "/usr/local/bin/aspell")))
 #+end_src

 #+RESULTS:
 : /usr/local/bin/aspell

** Better Defaults
   TODO document these chunks
 #+begin_src emacs-lisp
   ;;; Code:
   ;; Minimal UI
   (scroll-bar-mode  -1)
   (tool-bar-mode    -1)
   (tooltip-mode     -1)
   (blink-cursor-mode 0)
   (fringe-mode 0)
   (setq initial-scratch-message nil)
   (setq ring-bell-function 'ignore)
   (setq redisplay-dont-pause t ;; Scrolling smoothness
     scroll-margin 1
     scroll-step 1
     scroll-conservatively 10000
     scroll-preserve-screen-position 1)
   (setq temporary-file-directory (concat ak/custpath-emacsd "tmp")) ;; Don't save flycheck locally

   ;; standardizes all yes/no quetions to y/n.
   (fset 'yes-or-no-p 'y-or-n-p)

   ;; Show matching parens
   (setq show-paren-delay 0)
   (show-paren-mode 1)

   ;;match parens automatically
   (electric-pair-mode +1)

   ;; Pretty lambda symbol
   (global-prettify-symbols-mode 1)
   
   ;; automatically update buffers that have changed under file
   (global-auto-revert-mode t)
 #+end_src

 #+RESULTS:
 : t

    Org mode was being very slow on my windows machine, so I found [[https://www.reddit.com/r/emacs/comments/55ork0/is_emacs_251_noticeably_slower_than_245_on_windows/d8cmm7v/][this]] solution to improve garbage collection.
 #+begin_src emacs-lisp
   (when (eq window-system 'w32)
     (setq gc-cons-threshold (* 511 1024 1024))
     (setq gc-cons-percentage 0.5)
     (run-with-idle-timer 5 t #'garbage-collect)
     (setq garbage-collection-messages nil))
 #+end_src

 #+RESULTS:
 : t

    Windows doesn't have a super key, so I remap the windows key to super. The problem is that the windows key often can't be overridden. I don't use it often, so I might revert.
    If on a mac, I like the super and meta keys to be in the same location as when I'm on my windows machine.
#+begin_src emacs-lisp
  (cond ((eq window-system 'w32)
	 (setq w32-pass-lwindow-to-system nil)
	 (setq w32-lwindow-modifier 'super))
	((eq window-system 'ns)
	 (setq mac-command-modifier 'meta)
	 (setq mac-option-modifier 'super)))
#+end_src

#+RESULTS:
: super

** Temporary File Management
   Emacs is a little too eager to save files everywhere. I found the below to keep version control without it leaving files all over the place
 #+begin_src emacs-lisp
   (use-package files
     :init
     (setq backup-directory-alist `(("." . ,(concat ak/custpath-emacsd "backups"))))
     (setq confirm-nonexistent-file-or-buffer nil))
 #+end_src

 #+RESULTS:

** TODO Unicode
   When I use special characters in my org files (specifically this one) I get prompted by which character type should be saved. I havent solved this yet and it's what is preventing me from using fun characters for Org
#+begin_src emacs-lisp
  (if (eq window-system 'w32) (setq session-save-file-coding-system 'utf-8))
#+end_src

#+RESULTS:
: utf-16-le

* UI
