myinit.el
(let ((file-name-handler-alist nil))

(add-hook 'emacs-startup-hook
          (lambda ()
            (message "Emacs ready in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))

;;(setq debug-on-error t)

;; (when (require 'gcmh nil t)
;;   (gcmh-mode 1))

(setq gc-cons-threshold most-positive-fixnum)

(setq workstation 'catapult) ;; options: catapult, personal_macbook

(setq user-full-name "Andrew Kraemer")
(setq user-mail-address "andrew.h.kraemer@gmail.com")

(cond ((eq window-system 'w32)
       (setq ak/custpath-home "c:/Users/akraemer/"
	     ak/custpath-dropbox-org "c:/Users/akraemer/Dropbox/org/"
	     ak/custpath-phone-notes "c:/Users/akraemer/Dropbox/org/phone_inbox.org"
	     ak/custpath-journal-path "c:/Users/akraemer/Dropbox/journal/"
	     ak/custpath-emacsd "c:/emacs/.emacs.d/"
	     ak/custpath-org-notes "c:/emacs/notes/"
	     ak/custpath-py-default-env "c:/Users/akraemer/Anaconda3/envs/py37"
	     ak/custpath-flake8 "c:/Users/akraemer/Anaconda3/Scripts/flake8.exe"
	     ak/custpath-aspell "c:/msys64/mingw64/bin/aspell.exe"))
      ((eq window-system 'ns)
       (setq ak/custpath-home "/Users/AndrewKraemer/"
	     ak/custpath-dropbox-org "/Users/AndrewKraemer/Dropbox/org/"
	     ak/custpath-phone-notes "/Users/AndrewKraemer/Dropbox/org/phone_inbox.org"
	     ak/custpath-journal-path "/Users/AndrewKraemer/Dropbox/journal/"
	     ak/custpath-emacsd "~/.emacs.d/"
	     ak/custpath-org-notes "~/emacs/notes/"
	     ak/custpath-py-default-env "/Users/AndrewKraemer/anaconda3/envs/py37"
	     ak/custpath-aspell "/usr/local/bin/aspell")))

;;; Code:
;; Minimal UI
(scroll-bar-mode  -1)
(tool-bar-mode    -1)
(tooltip-mode     -1)
(blink-cursor-mode 0)
(fringe-mode 0)
(setq initial-scratch-message nil)
(setq ring-bell-function 'ignore)
(setq redisplay-dont-pause t ;; Scrolling smoothness
  scroll-margin 1
  scroll-step 1
  scroll-conservatively 10000
  scroll-preserve-screen-position 1)
(setq temporary-file-directory (concat ak/custpath-emacsd "tmp")) ;; Don't save flycheck locally

;; standardizes all yes/no quetions to y/n.
(fset 'yes-or-no-p 'y-or-n-p)

;; Show matching parens
(setq show-paren-delay 0)
(show-paren-mode 1)

;;match parens automatically
(electric-pair-mode +1)

;; Pretty lambda symbol
(global-prettify-symbols-mode 1)

(when (eq window-system 'w32)
  (setq gc-cons-threshold (* 511 1024 1024))
  (setq gc-cons-percentage 0.5)
  (run-with-idle-timer 5 t #'garbage-collect)
  (setq garbage-collection-messages nil))

(cond ((eq window-system 'w32)
       (setq w32-pass-lwindow-to-system nil)
       (setq w32-lwindow-modifier 'super))
      ((eq window-system 'ns)
       (setq mac-command-modifier 'meta)
       (setq mac-option-modifier 'super)))

(use-package files
  :init
  (setq backup-directory-alist `(("." . ,(concat ak/custpath-emacsd "backups"))))
  (setq confirm-nonexistent-file-or-buffer nil))

(set-selection-coding-system
  (if (eq system-type 'windows-nt)
      'utf-16-le  ;; https://rufflewind.com/2014-07-20/pasting-unicode-in-emacs-on-windows
    'utf-8))
