myinit.org
** Font
  I find that consolas works really well on my windows machine, but Source Code Pro is just a little more nifty. Normal thickness on windows doesn't look great with orgmode on my windows machine, so I have different settings for different computers
 #+begin_src emacs-lisp
   ;; (set-face-attribute 'default nil :family "Consolas" :height 110)
   ;; (set-face-attribute 'default nil :family "Hack" :height 105)
   (cond ((eq window-system 'w32)
	  (set-face-attribute 'default nil
			      :family "Source Code Pro"
			      :weight 'Regular
			      ;; :weight 'bold
			      ;; :width 'normal
			      :height 107))
	 ((eq window-system 'ns)
	  (set-face-attribute 'default nil
			      :family "Source Code Pro"
			      :weight 'normal
			      ;; :weight 'bold
			      ;; :width 'normal
			      :height 140)))
 #+end_src

 #+RESULTS:

** Theme
   I love the nord theme. It's not too harsh on the eyes and I think it looks really cool.
   counsel-load-theme is a great way to preview themes with `C-M-n` / `C-M-p`
 #+begin_src emacs-lisp
   (use-package doom-themes
     :ensure t
     :config (load-theme 'doom-nord t))

   (use-package color-theme-sanityinc-tomorrow
     :disabled
     :ensure t
     :config
     (load-theme 'sanityinc-tomorrow-eighties t))
 #+end_src

** Modeline
   Telephone line is a modeline replacement which is clean, light, and evil friendly. It's allegedly easy to configure, but I'm happy with the default.
   TODO try evil mode abbreviation to save on realestate
 #+begin_src emacs-lisp
  (use-package telephone-line
   :init (telephone-line-mode 1))
 #+end_src

 #+RESULTS:
* Evil
#+begin_src emacs-lisp
  (use-package evil
    :ensure t
     ;; c-u to scroll up
    :init
    (setq evil-want-C-u-scroll t)
    :config
    (evil-mode 1)
    (add-hook 'prog-mode-hook #'turn-on-evil-mode))

  (use-package evil-surround
    :ensure t
    :config
    (global-evil-surround-mode 1))

  (use-package evil-commentary
    :ensure t
    :config
    (evil-commentary-mode))

  (use-package evil-numbers
    :ensure t)
#+end_src

* Window Management
  I do a lot in emacs, and it can be overwhelming to manage all of the different buffers and windows lying about.
** Winner
   Winner allows me to iterate through previous window configurations. I've got some files listed to ignore as well.
   TODO I'd like to make a hydra for iterating through my winner states faster
 #+begin_src emacs-lisp
 (use-package winner
   :init (setq winner-boring-buffers
         '("*Completions*"
           "*Compile-Log*"
           "*inferior-lisp*"
           "*Fuzzy Completions*"
           "*Apropos*"
           "*dvc-error*"
           "*Help*"
           "*cvs*"
           "*Buffer List*"
           "*Ibuffer*"))
   :config (winner-mode 1))
 #+end_src

** Shackle
   Emacs will pop files up all over the place. This package helps reduce the insanity that results from this. I haven't done a comparison of how this changes the pop ups, but I get a sense that they are now more manageable
 #+begin_src emacs-lisp
   (use-package shackle
     :ensure t
     :defer t
     :config
     ;; (setq shackle-default-rule '(:select t))
     (shackle-mode t))
 #+end_src

 #+RESULTS:
 : t

** Golden Ratio
   When I'm coding there is usally a file that I'm focusing on. Golden ratio allows me to balance the window sizes based on the golden ratio. I don't like it on all of the time, but I can activate it with `<SPC> w g`
 #+begin_src emacs-lisp
   (use-package golden-ratio
     :ensure t)
 #+end_src
 
* Ivy, Counsel, Swiper
  - Hide star buffers w/ ivy-ignore buffers. Use C-c C-a to toggle back. Ref [[https://github.com/abo-abo/swiper/issues/644][here]].
#+begin_src emacs-lisp
  (use-package ivy
    :ensure t
    :init
    (setq ivy-use-virtual-buffers t
	  enable-recursive-minibuffers t
          ivy-initial-inputs-alist nil ;; don't use ^ w/ ivy M-x 
	  ivy-re-builders-alist
	    '((swiper . regexp-quote)
	      (t      . ivy--regex-fuzzy)))
    :config
    (setq ivy-ignore-buffers '("\\` " "\\`\\*")) ;; hide star buffers note above
    (ivy-mode 1))

  ;; fuzzy matching for ivy
  (use-package flx
    :ensure t)

  (use-package counsel
    :ensure t)
#+end_src

#+RESULTS:

* Org
** General Org Settings
   Define paths and files of where to look for tasks.
  #+begin_src emacs-lisp
    (with-eval-after-load 'org (setq org-agenda-files
				    `(,ak/custpath-org-notes ,ak/custpath-phone-notes)))
  #+end_src 
  
  I love using habits in org-mode, you need to make sure to call them out to use them, which is what this code snippet does
  #+begin_src emacs-lisp
    (with-eval-after-load 'org
      (add-to-list 'org-modules 'org-habit t))
  #+end_src
  
  This seems to be somehow related to the [[https://github.com/Somelauw/evil-org-mode/blob/master/doc/example_config.el][evil-org]] package, which I decided against using awhile ago. I don't know if this does anything
  TODO test org mode without this block
  #+begin_src emacs-lisp
    (setq evil-org-key-theme '(textobjects navigation additional insert todo))
  #+end_src 


** Org Tasking
   These are my todo states. They are ordered by priority and, as such, Impact how my org-agenda is displayed
  #+begin_src emacs-lisp
    (setq org-todo-keywords
	  (quote ((sequence "IN_PROGRESS(i)" "NEXT(n)" "TODO(t)" "WAITING(w@/)" "DONE(d)"))))
  #+end_src

  This allows me to refile bullets to four levels deep in any of my org-agenda files
  #+begin_src emacs-lisp
    (setq org-refile-targets '((nil :maxlevel . 4)
			       (org-agenda-files :maxlevel . 4)))
  #+end_src

  Org caputure templates allow you to quickly create tasks following a structure. I like to make sure all tasks have a priority & go to my inbox. I have this large meeting template, but i don't use it currently. I still am working on a way of better capturing one-off notes related to a project.
  #+begin_src emacs-lisp
    (defvar my/org-meeting-template "** Meeting about %^{something}
      SCHEDULED: %<%Y-%m-%d %H:%M>
      ,*Attendees:*
      - [X] Nick Anderson
      - [ ] %?
      ,*Agenda:*
      -
      -
      ,*Notes:*
      ")

    (setq org-capture-templates
	`(;; Note the backtick here, it's required so that the defvar based tempaltes will work!
	  ;;http://comments.gmane.org/gmane.emacs.orgmode/106890

	  ("t" "To-do" entry (file+headline ,(concat ak/custpath-org-notes "gtd.org") "Inbox")
	    "** TODO [#%^{priority}] %^{Task Description}" :prepend t)
	  ("c" "To-do Link" entry (file+headline ,(concat ak/custpath-org-notes "gtd.org") "Inbox")
	    "** TODO [#%^{priority}] %A \n:PROPERTIES:\n:Created: %U\n:Source: %a\n:END:\n%?"
	    :prepend t)
	  ("m" "Meeting" entry (file+headline ,(concat ak/custpath-org-notes "meetings.org") "Meeting Notes")
	   ,my/org-meeting-template)
    ))

 #+end_src

 #+RESULTS:
 | t | To-do      | entry | (file+headline c:/emacs/notes/gtd.org Inbox) | ** TODO [#%^{priority}] %^{Task Description} | :prepend | t |
 | c | To-do Link | entry | (file+headline c:/emacs/notes/gtd.org Inbox) | ** TODO [#%^{priority}] %A                   |          |   |
