myinit.el

;; (set-face-attribute 'default nil :family "Consolas" :height 110)
;; (set-face-attribute 'default nil :family "Hack" :height 105)
(cond ((eq window-system 'w32)
       (set-face-attribute 'default nil
			   :family "Source Code Pro"
			   :weight 'Regular
			   ;; :weight 'bold
			   ;; :width 'normal
			   :height 107))
      ((eq window-system 'ns)
       (set-face-attribute 'default nil
			   :family "Source Code Pro"
			   :weight 'normal
			   ;; :weight 'bold
			   ;; :width 'normal
			   :height 140)))

(use-package doom-themes
  :ensure t
  :config (load-theme 'doom-nord t))

(use-package color-theme-sanityinc-tomorrow
  :disabled
  :ensure t
  :config
  (load-theme 'sanityinc-tomorrow-eighties t))

(use-package telephone-line
 :init (telephone-line-mode 1))

(use-package evil
  :ensure t
   ;; c-u to scroll up
  :init
  (setq evil-want-C-u-scroll t)
  :config
  (evil-mode 1)
  (add-hook 'prog-mode-hook #'turn-on-evil-mode))

(use-package evil-surround
  :ensure t
  :config
  (global-evil-surround-mode 1))

(use-package evil-commentary
  :ensure t
  :config
  (evil-commentary-mode))

(use-package evil-numbers
  :ensure t)

(use-package winner
  :init (setq winner-boring-buffers
        '("*Completions*"
          "*Compile-Log*"
          "*inferior-lisp*"
          "*Fuzzy Completions*"
          "*Apropos*"
          "*dvc-error*"
          "*Help*"
          "*cvs*"
          "*Buffer List*"
          "*Ibuffer*"))
  :config (winner-mode 1))

(use-package shackle
  :ensure t
  :defer t
  :config
  ;; (setq shackle-default-rule '(:select t))
  (shackle-mode t))

(use-package golden-ratio
  :ensure t)

(use-package ivy
  :ensure t
  :init
  (setq ivy-use-virtual-buffers t
	enable-recursive-minibuffers t
        ivy-initial-inputs-alist nil ;; don't use ^ w/ ivy M-x 
	ivy-re-builders-alist
	  '((swiper . regexp-quote)
	    (t      . ivy--regex-fuzzy)))
  :config
  (setq ivy-ignore-buffers '("\\` " "\\`\\*")) ;; hide star buffers note above
  (ivy-mode 1))

;; fuzzy matching for ivy
(use-package flx
  :ensure t)

(use-package counsel
  :ensure t)

(with-eval-after-load 'org (setq org-agenda-files
				`(,ak/custpath-org-notes ,ak/custpath-phone-notes)))

(with-eval-after-load 'org
  (add-to-list 'org-modules 'org-habit t))

(setq evil-org-key-theme '(textobjects navigation additional insert todo))

(setq org-todo-keywords
      (quote ((sequence "IN_PROGRESS(i)" "NEXT(n)" "TODO(t)" "WAITING(w@/)" "DONE(d)"))))

(setq org-refile-targets '((nil :maxlevel . 4)
			   (org-agenda-files :maxlevel . 4)))

(defvar my/org-meeting-template "** Meeting about %^{something}
  SCHEDULED: %<%Y-%m-%d %H:%M>
  *Attendees:*
  - [X] Nick Anderson
  - [ ] %?
  *Agenda:*
  -
  -
  *Notes:*
  ")

(setq org-capture-templates
    `(;; Note the backtick here, it's required so that the defvar based tempaltes will work!
      ;;http://comments.gmane.org/gmane.emacs.orgmode/106890

      ("t" "To-do" entry (file+headline ,(concat ak/custpath-org-notes "gtd.org") "Inbox")
	"** TODO [#%^{priority}] %^{Task Description}" :prepend t)
      ("c" "To-do Link" entry (file+headline ,(concat ak/custpath-org-notes "gtd.org") "Inbox")
	"** TODO [#%^{priority}] %A \n:PROPERTIES:\n:Created: %U\n:Source: %a\n:END:\n%?"
	:prepend t)
      ("m" "Meeting" entry (file+headline ,(concat ak/custpath-org-notes "meetings.org") "Meeting Notes")
       ,my/org-meeting-template)
))
