myinit.org
** Org-Agenda / priority
   I use my org agenda extensively. It's the holy grail of task management for me. I use `<SPC> o o` to quickly jump to my agenda. It's where I manage task completion. It's where I kick off my pomodoro timers. I can filter it by tags with `/ <TAB>` 
   This section gets a bit nitty gritty. Look at the [[https://orgmode.org/worg/doc.html][Worg documentation]] for details on these settings.

   Only show details for today when viewing the org agenda. I don't know which one does what, but org-agenda-show-future-repeats is allegedly the most up to date
 #+begin_src emacs-lisp
   (setq org-habit-show-all-today t)
   (setq org-habit-show-habits-only-for-today t)
   (setq org-agenda-show-future-repeats 'next)
 #+end_src

 #+RESULTS:
 : next

   Non prioritized tasks will be sorted to d, though I usually make sure to priotize all of my tasks w/ my org capture
 #+begin_src emacs-lisp
   (setq org-lowest-priority ?D)
   (setq org-default-priority ?D)
 #+end_src

   Customize the order in which tasks appear in the agenda
 #+begin_src emacs-lisp
   (setq org-agenda-sorting-strategy
       '((agenda habit-up deadline-up scheduled-up priority-up) ;; show habits, then time, then by priority
	 (tags todo-state-up deadline-up) ;; show todo-state then deadlines
	 (search category-keep)))
 #+end_src

 #+RESULTS:
 | agenda | habit-up      | deadline-up | scheduled-up | priority-up |
 | tags   | todo-state-up | deadline-up |              |             |
 | search | category-keep |             |              |             |

   Custom agenda filtering functions modified from [[https://blog.aaronbieber.com/2016/09/24/an-agenda-for-life-with-org-mode.html][Aaron Bieber]] as well as some of my own
 #+begin_src emacs-lisp
   (defun air-org-skip-subtree-if-habit ()
     "Skip an agenda entry if it has a STYLE property equal to \"habit\"."
     (let ((subtree-end (save-excursion (org-end-of-subtree t))))
       (if (string= (org-entry-get nil "STYLE") "habit")
	 subtree-end
       nil)))

   (defun air-org-skip-subtree-if-priority (priority)
     "Skip an agenda subtree if it has a priority of PRIORITY.
   PRIORITY may be one of the characters ?A, ?B, or ?C."
     (let ((subtree-end (save-excursion (org-end-of-subtree t)))
	 (pri-value (* 1000 (- org-lowest-priority priority)))
	 (pri-current (org-get-priority (thing-at-point 'line t))))
       (if (= pri-value pri-current)
	 subtree-end
       nil)))
      
   (defvar current-date-format "%Y-%m-%d"
     "Format of date to insert with `insert-current-date-time' func
      See help of `format-time-string' for possible replacements")

   (defun ak/org-skip-subtree-if-not-archived-today ()
     "Skip an agenda entry if it was not completed today"
     (concat ":ARCHIVE_TIME: " (format-time-string current-date-format (current-time))))
 #+end_src

 #+RESULTS:
 : air-org-skip-subtree-if-priority

   Settings for the different agenda blocks.
   - *Daily Agenda* is my primary view of all of my tasks
   - *Day in Review* gives me a way of seeing all of the tasks that I archvied (completed in a day)
   Utilizes Aaron Bieber functions to prevent tasks from appearing multiple times in agenda.
   TODO it might be smarter to have the custom commands saved separately for better documentation
 #+begin_src emacs-lisp
   (setq org-agenda-custom-commands
	 '(("d" "Daily agenda and all TODOs"
	    ((tags "PRIORITY=\"A\""
		   ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
		    (org-agenda-overriding-header "High-priority unfinished tasks:")))
	     (agenda ""
		     ((org-agenda-span 'day)
		      (org-agenda-overriding-header "ALL normal priority tasks:")))
	     (tags (or "PRIORITY=\"B\"" "PRIORITY=\"C\"")
		   ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
		    (org-agenda-overriding-header "Unfinished tasks:")))
	     (alltodo ""
		      ((org-agenda-skip-function '(or (air-org-skip-subtree-if-habit)
						      (air-org-skip-subtree-if-priority ?A)
						      (air-org-skip-subtree-if-priority ?B)
						      (org-agenda-skip-if nil '(scheduled deadline))))
		       (org-agenda-overriding-header "Eventually:"))))
	    ;; ((org-agenda-compact-blocks t)) ;; removes = breaks
	    )
	   ("r" "Day in review"
	      todo "DONE"
	      ;; agenda settings
	      ((org-agenda-files '("c:/emacs/notes/gtd.org_archive"))
	       (org-agenda-start-with-log-mode '(ARCHIVE_TIME))
	       (org-agenda-archives-mode t)
               (org-agenda-skip-function '(org-agenda-skip-entry-if 'notregexp (ak/org-skip-subtree-if-not-archived-today)))
	       (org-agenda-overriding-header "Day in Review"))
	      ;; ("~/org/review/day.html") ;; for export
		   )))
 #+end_src

   I love this function. It brings the agenda front and center. Thanks [[https://blog.aaronbieber.com/2016/09/24/an-agenda-for-life-with-org-mode.html][Aaron Bieber]].
 #+begin_src emacs-lisp
   (defun air-pop-to-org-agenda (&optional split)
     "Visit the org agenda, in the current window or a SPLIT."
     (interactive "P")
     (org-agenda nil "d")
     (when (not split)
     (delete-other-windows)))
 #+end_src

** Org-Bullets
   Org-Bullets makes the bullets in orgmode just a little bit nicer to look at.
#+begin_src emacs-lisp
  (use-package org-bullets
    :ensure t
    :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
#+end_src
** Org-pomodoro
   On good days, I use the pomodoro technique to track time and stay focused. I have my agenda customized to start a pomodoro for a task when I press `p` over a task. I can stop tracking on a task by pressing `O` then clock in with `I`. It's very neat, and I'm still getting the hang of it.
 #+begin_src emacs-lisp
   ;; https://github.com/yanivdll/.emacs.d/blob/master/config.org
   (use-package org-pomodoro
     :ensure t
     :config (setq org-pomodoro-play-sounds 1
		   org-pomodoro-finished-sound "c:/Users/akraemer/Dropbox/org/sounds/tone.wav"
		   org-pomodoro-long-break-sound "c:/Users/akraemer/Dropbox/org/sounds/tone.wav"
		   org-pomodoro-short-break-sound "c:/Users/akraemer/Dropbox/org/sounds/tone.wav"))
#+end_src


   I found the standard bell for the pomodoro timer to be a bit harsh, so I found a soothing yoga bell to use instead. To play wav files, I needed the sound-wav package. To use sound-wav on PC I need to make sure powershell is installed.
   TODO For some reason, powershell causes my emacs to start with a split window.
#+begin_src emacs-lisp
  ;;https://emacs.stackexchange.com/a/48352
  ;; required for org-sounds
  (use-package sound-wav
    :ensure t)

  ;; ;; required for sound if on windows
  (use-package powershell
    :if (memq window-system '(w32))
    :ensure t)
  #+end_src

  #+RESULTS:

#+RESULTS:

** Org-download
 #+begin_src emacs-lisp
(use-package org-download
  :ensure t
  :config
  ;; add support to dired
  (add-hook 'dired-mode-hook 'org-download-enable))
 #+end_src
 
 #+RESULTS:
 : t
** Org-journal
 #+begin_src emacs-lisp
  (use-package org-journal
   :ensure t
   :defer t
   :custom
   (org-journal-dir ak/custpath-journal-path)
   (org-journal-date-format "%Y-%m-%d"))
 #+end_src

 #+RESULTS:
 : t

** Org-Babel
 #+begin_src emacs-lisp
   (org-babel-do-load-languages
   'org-babel-load-languages
   '((R . t)
       (python . t)))
   ;; put viz inline by default
   (setq org-startup-with-inline-images t)

   (use-package ox-pandoc
     :ensure t
     :defer t)

    ;; pulled form my spacemacs for latex
    ;; (setenv "PATH" (concat (getenv "PATH") ":/sw/bin"))
    ;; (setq exec-path (append exec-path '("/sw/bin")))
 #+end_src

* Code & Development Tools
** Yasnippet
 #+begin_src emacs-lisp
 (use-package yasnippet
   :ensure t
   :defer 2
   :init
   (yas-global-mode 1))

 (use-package yasnippet-snippets
   :ensure t)
 #+end_src

** Company
    Auto-completion
   - TODO move this to the general section
 #+begin_src emacs-lisp
   (use-package company
     :hook
     (after-init . global-company-mode)
     :bind
     ;; make company completion work w/ vimkeys
     (:map company-active-map)
     ("C-n" . company-select-next-or-abort)
     ("C-p" . company-select-previous-or-abort))
 #+end_src

 #+RESULTS:

** Magit
 #+begin_src emacs-lisp
   (use-package magit
     :ensure t)
  
   (use-package evil-magit
     :after magit)

   (use-package git-gutter
     :ensure t
     :config
     (global-git-gutter-mode 't)
     :diminish git-gutter-mode)
 #+end_src

 #+RESULTS:

** Projectile
 #+begin_src emacs-lisp
    (use-package projectile
      :ensure t
      :init
      (setq projectile-require-project-root nil)
      (setq projectile-completion-system 'ivy)
      :config
      (projectile-mode 1))

    (use-package counsel-projectile
     :ensure t
     :config
     (counsel-projectile-mode))
 #+end_src

 #+RESULTS:
 : t

** Lispy
 #+begin_src emacs-lisp
   (use-package lisp;; y
     :disabled
     :ensure t
     :defer t
     :init
       (general-add-hook '(hy-mode-hook lisp-mode-hook emacs-lisp-mode-hook) #'lispy-mode)
       ;; (add-hook 'hy-mode-hook #'lispy-mode)
       ;; (add-hook 'lisp-mode-hook #'lispy-mode)
       ;; (add-hook 'emacs-lisp-mode-hook #'lispy-mode)
   )

   (use-package lispyville
     :ensure t
     :defer t
     :init
       (general-add-hook '(emacs-lisp-mode-hook hy-mode-hook lisp-mode-hook) #'lispyville-mode))
     :config
       (lispyville-set-key-theme '(additional prettify text-objects atom-motions additional-motions commentary slurp/barf-cp additional-wrap))
 #+end_src

 #+RESULTS:

** Python
