myinit.el

(setq org-habit-show-all-today t)
(setq org-habit-show-habits-only-for-today t)
(setq org-agenda-show-future-repeats 'next)

(setq org-lowest-priority ?D)
(setq org-default-priority ?D)

(setq org-agenda-sorting-strategy
    '((agenda habit-up deadline-up scheduled-up priority-up) ;; show habits, then time, then by priority
      (tags todo-state-up deadline-up) ;; show todo-state then deadlines
      (search category-keep)))

(defun air-org-skip-subtree-if-habit ()
  "Skip an agenda entry if it has a STYLE property equal to \"habit\"."
  (let ((subtree-end (save-excursion (org-end-of-subtree t))))
    (if (string= (org-entry-get nil "STYLE") "habit")
      subtree-end
    nil)))

(defun air-org-skip-subtree-if-priority (priority)
  "Skip an agenda subtree if it has a priority of PRIORITY.
PRIORITY may be one of the characters ?A, ?B, or ?C."
  (let ((subtree-end (save-excursion (org-end-of-subtree t)))
      (pri-value (* 1000 (- org-lowest-priority priority)))
      (pri-current (org-get-priority (thing-at-point 'line t))))
    (if (= pri-value pri-current)
      subtree-end
    nil)))

(defvar current-date-format "%Y-%m-%d"
  "Format of date to insert with `insert-current-date-time' func
   See help of `format-time-string' for possible replacements")

(defun ak/org-skip-subtree-if-not-archived-today ()
  "Skip an agenda entry if it was not completed today"
  (concat ":ARCHIVE_TIME: " (format-time-string current-date-format (current-time))))

(setq org-agenda-custom-commands
      '(("d" "Daily agenda and all TODOs"
	 ((tags "PRIORITY=\"A\""
		((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
		 (org-agenda-overriding-header "High-priority unfinished tasks:")))
	  (agenda ""
		  ((org-agenda-span 'day)
		   (org-agenda-overriding-header "ALL normal priority tasks:")))
	  (tags (or "PRIORITY=\"B\"" "PRIORITY=\"C\"")
		((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
		 (org-agenda-overriding-header "Unfinished tasks:")))
	  (alltodo ""
		   ((org-agenda-skip-function '(or (air-org-skip-subtree-if-habit)
						   (air-org-skip-subtree-if-priority ?A)
						   (air-org-skip-subtree-if-priority ?B)
						   (org-agenda-skip-if nil '(scheduled deadline))))
		    (org-agenda-overriding-header "Eventually:"))))
	 ;; ((org-agenda-compact-blocks t)) ;; removes = breaks
	 )
	("r" "Day in review"
	   todo "DONE"
	   ;; agenda settings
	   ((org-agenda-files '("c:/emacs/notes/gtd.org_archive"))
	    (org-agenda-start-with-log-mode '(ARCHIVE_TIME))
	    (org-agenda-archives-mode t)
            (org-agenda-skip-function '(org-agenda-skip-entry-if 'notregexp (ak/org-skip-subtree-if-not-archived-today)))
	    (org-agenda-overriding-header "Day in Review"))
	   ;; ("~/org/review/day.html") ;; for export
		)))

(defun air-pop-to-org-agenda (&optional split)
  "Visit the org agenda, in the current window or a SPLIT."
  (interactive "P")
  (org-agenda nil "d")
  (when (not split)
  (delete-other-windows)))

(use-package org-bullets
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

;; https://github.com/yanivdll/.emacs.d/blob/master/config.org
(use-package org-pomodoro
  :ensure t
  :config (setq org-pomodoro-play-sounds 1
		org-pomodoro-finished-sound "c:/Users/akraemer/Dropbox/org/sounds/tone.wav"
		org-pomodoro-long-break-sound "c:/Users/akraemer/Dropbox/org/sounds/tone.wav"
		org-pomodoro-short-break-sound "c:/Users/akraemer/Dropbox/org/sounds/tone.wav"))

;;https://emacs.stackexchange.com/a/48352
;; required for org-sounds
(use-package sound-wav
  :ensure t)

;; ;; required for sound if on windows
(use-package powershell
  :if (memq window-system '(w32))
  :ensure t)

(use-package org-download
  :ensure t
  :config
  ;; add support to dired
  (add-hook 'dired-mode-hook 'org-download-enable))

(use-package org-journal
 :ensure t
 :defer t
 :custom
 (org-journal-dir ak/custpath-journal-path)
 (org-journal-date-format "%Y-%m-%d"))

(org-babel-do-load-languages
'org-babel-load-languages
'((R . t)
    (python . t)))
;; put viz inline by default
(setq org-startup-with-inline-images t)

(use-package ox-pandoc
  :ensure t
  :defer t)

 ;; pulled form my spacemacs for latex
 ;; (setenv "PATH" (concat (getenv "PATH") ":/sw/bin"))
 ;; (setq exec-path (append exec-path '("/sw/bin")))

(use-package yasnippet
  :ensure t
  :defer 2
  :init
  (yas-global-mode 1))

(use-package yasnippet-snippets
  :ensure t)

(use-package company
  :hook
  (after-init . global-company-mode)
  :bind
  ;; make company completion work w/ vimkeys
  (:map company-active-map)
  ("C-n" . company-select-next-or-abort)
  ("C-p" . company-select-previous-or-abort))

(use-package magit
  :ensure t)

(use-package evil-magit
  :after magit)

(use-package git-gutter
  :ensure t
  :config
  (global-git-gutter-mode 't)
  :diminish git-gutter-mode)

(use-package projectile
  :ensure t
  :init
  (setq projectile-require-project-root nil)
  (setq projectile-completion-system 'ivy)
  :config
  (projectile-mode 1))

(use-package counsel-projectile
 :ensure t
 :config
 (counsel-projectile-mode))

(use-package lisp;; y
  :disabled
  :ensure t
  :defer t
  :init
    (general-add-hook '(hy-mode-hook lisp-mode-hook emacs-lisp-mode-hook) #'lispy-mode)
    ;; (add-hook 'hy-mode-hook #'lispy-mode)
    ;; (add-hook 'lisp-mode-hook #'lispy-mode)
    ;; (add-hook 'emacs-lisp-mode-hook #'lispy-mode)
)

(use-package lispyville
  :ensure t
  :defer t
  :init
    (general-add-hook '(emacs-lisp-mode-hook hy-mode-hook lisp-mode-hook) #'lispyville-mode))
  :config
    (lispyville-set-key-theme '(additional prettify text-objects atom-motions additional-motions commentary slurp/barf-cp additional-wrap))

;; Python
