myinit.org
*** Elpy
    Elpy is the python IDE for emacs. I was able to get this working on my windows pc but could not figure out what was going on on my mac
  #+begin_src emacs-lisp
    ;; Python
    (use-package elpy
      :if (eq window-system 'w32)
      :ensure t
      :defer t
      :init
	(advice-add 'python-mode :before 'elpy-enable)

	;; windows setup
	(when (eq window-system 'w32)
	  (pyvenv-activate ak/custpath-py-default-env)
	  (setq python-shell-interpreter "jupyter"
	    python-shell-interpreter-args "console --simple-prompt"
	    python-shell-prompt-detect-failure-warning nil))
	;; couldn't get this to work on mac
	;; (when (eq window-system 'ns)
	;;   (pyvenv-activate "~/anaconda3/envs/py37")
	;;   (setq python-shell-interpreter-args "console --simple-prompt"
	;; 	python-shell-prompt-detect-failure-warning nil))
	:config
	(setq elpy-modules (delq 'elpy-module-flymake elpy-modules)) ;; don't use use flymake
	(add-hook 'elpy-mode-hook 'flycheck-mode) ;; use use flycheck instead
	(when (eq window-system 'w32)
	  (setq flycheck-python-flake8-executable ak/custpath-flake8))  ;; Need to install flake8 explicitly on windows
    )
  #+end_src

  #+RESULTS:
  : t

*** anaconda-mode
  no idea how any of this works. Stole from [[https://github.com/howardabrams/dot-files/blob/master/emacs-python.org][here]]
 #+begin_src emacs-lisp
  (use-package jedi
   :ensure t
   :config
   (use-package company-jedi
     :ensure t
     :init
     (add-hook 'python-mode-hook (lambda () (add-to-list 'company-backends 'company-jedi)))
     (setq company-jedi-python-bin "python"))
   (add-to-list 'company-backends 'company-jedi))
 #+end_src

 #+RESULTS:
 : t

 #+begin_src emacs-lisp
   (use-package anaconda-mode
     :if (eq window-system 'ns)
     :ensure t
     :defer t
     :bind
      (:map company-active-map)
      ("e" . pythonic-activate)
     :init (add-hook 'python-mode-hook 'anaconda-mode)
	   (add-hook 'python-mode-hook 'anaconda-eldoc-mode)
     :config
       ;; (pythonic-activate "~/anaconda3/envs/py37")
       (pythonic-activate "~/anaconda3/envs/ml4t") ;; for class
       (use-package company-anaconda
	 :ensure t
	 :init (add-hook 'python-mode-hook 'anaconda-mode)
	 (eval-after-load "company"
	   '(add-to-list 'company-backends '(company-anaconda :with company-capf)))))

 #+end_src

 #+RESULTS:
 : pythonic-activate

** lisps
   I love lisp. I spend too much time farting around with them.
*** hy
    Hy is a lisp with a python back-end. I love the idea of it but haven't had the opportunity to really dive into it.
  #+begin_src emacs-lisp
  (use-package hy-mode
    :ensure t
    :defer t
    :init (add-hook 'hy-mode-hook 'lispyville-mode))
  #+end_src
*** Racket
    After previously playing around with common-lisp and being somewhat overwhelmed by it -- as it is very old -- I've more recently decided to take on Racket as my default scripting lisp. It has multiple language modes, such as being used to be able to work with the same syntax as [[https://mitpress.mit.edu/sites/default/files/sicp/index.html][SICP]].
  #+begin_src emacs-lisp
    (use-package racket-mode
      :ensure t
      :defer t
      :init
	(add-hook 'racket-mode-hook 'lispyville-mode)
	(if (eq window-system 'w32) (setq racket-program "c:/Program Files/Racket/Racket.exe")))
  #+end_src

  #+RESULTS:
  : c:/Program Files/Racket/Racket.exe

* Writing
** Writeroom
   Write room is a package great for narrowing my focus on writing. It takes the full screen, much like your average "distraction free" writing enviornments. It's also nice to use with my helper function C-c f (f for focus) which toggles the narrowing of a sub tree in case I'm working with an unweildy org file
#+begin_src emacs-lisp
  (use-package writeroom-mode
    :ensure t)
#+end_src

** Word Count
   I want to experiment with writing 750 words in my journal a day. The settings below makes sure that I get a word count when I'm using my journal.
#+begin_src emacs-lisp
  (use-package wc-mode
    :ensure t)
#+end_src

#+RESULTS:

* Checks
** Spelling
   I use aspell as my dictionary.
   - For windows: install instructions from [[https://www.reddit.com/r/emacs/comments/8by3az/how_to_set_up_sell_check_for_emacs_in_windows/][this reddit page]]. User thrillsd instructions using mysys2.
   - For Mac: install w/ Brew
 #+begin_src emacs-lisp
   (setq-default ispell-program-name ak/custpath-aspell)
 #+end_src

 #+RESULTS:
 : /usr/local/bin/aspell

** Flycheck
   Flycheck is my error checker. I have the flymake-run-in-place to avoid saving flymake files all over the place
 #+begin_src emacs-lisp
   (use-package flycheck
     :init  (setq flymake-run-in-place nil) ;; don't save flymake locally
     :ensure t)
 #+end_src

* Shell
  In emacs, I try to use eshell as much as possible. It does a good job -- especially compared to my options on windows. I'm interested in Elvish, which i might try some time
  In this block, I use some custom code to make sure the terminal alwasys appears on the bottom of the frame. It doesn't always work how I want it to, so I might change how I interact with it going forward
#+begin_src emacs-lisp
  (defun new-eshell ()
    "Open eshell on bottom of screen."
    (interactive)
    (when (one-window-on-screen-p)
      (let* ((lines (window-body-height))
	     (new-window (split-window-vertically (floor (* 0.7 lines)))))
	(select-window new-window)
	(eshell "eshell"))))

  (defun one-window-on-screen-p ()
    "Check if there is only one buffer on the screen."
    (= (length (window-list)) 1))
#+end_src

* Remote connections
  Tramp allows me to access remote files. Getting it to work with windows is a little clunky. Follow these steps:
  - Snippet taken from here https://www.emacswiki.org/emacs/Tramp_on_Windows
  - create saved session in putty then use the name like shown below
  - run the following in eshell: "find-file /plink:bort:~/" Need to figure out how to get this to run in counsel-find file or get an easier way to access the vanilla find-file
#+begin_src emacs-lisp
  (use-package tramp
    :ensure t
    :defer t
    :init
     (when (eq window-system 'w32)
       (setq tramp-default-method "plink")
       (setenv "PATH" (concat "c:/Program Files/PuTTY/" ";" (getenv "PATH")))))
#+end_src

* Expand Region
  when you start on a word you can press `C-=` to expand to sentace/ line. Very helpful for mass grabbing. Very highly rated from what I've read
#+begin_src emacs-lisp
(use-package expand-region 
  :ensure t)
#+end_src

#+RESULTS:

* Key Bindings
** Which-Key
   which-key states which possible key commbinations can be used after a button is input
 #+begin_src emacs-lisp
 (use-package which-key
   :ensure t
   :init
   (setq which-key-separator " ")
   (setq which-key-prefix-prefix "+")
   :config
   (which-key-mode 1))
 #+end_src
 
