myinit.el
(use-package elpy
  :if (eq window-system 'w32)
  :ensure t
  :defer t
  :init
    (advice-add 'python-mode :before 'elpy-enable)

    ;; windows setup
    (when (eq window-system 'w32)
      (pyvenv-activate ak/custpath-py-default-env)
      (setq python-shell-interpreter "jupyter"
	python-shell-interpreter-args "console --simple-prompt"
	python-shell-prompt-detect-failure-warning nil))
    ;; couldn't get this to work on mac
    ;; (when (eq window-system 'ns)
    ;;   (pyvenv-activate "~/anaconda3/envs/py37")
    ;;   (setq python-shell-interpreter-args "console --simple-prompt"
    ;; 	python-shell-prompt-detect-failure-warning nil))
    :config
    (setq elpy-modules (delq 'elpy-module-flymake elpy-modules)) ;; don't use use flymake
    (add-hook 'elpy-mode-hook 'flycheck-mode) ;; use use flycheck instead
    (when (eq window-system 'w32)
      (setq flycheck-python-flake8-executable ak/custpath-flake8))  ;; Need to install flake8 explicitly on windows
)

(use-package jedi
 :ensure t
 :config
 (use-package company-jedi
   :ensure t
   :init
   (add-hook 'python-mode-hook (lambda () (add-to-list 'company-backends 'company-jedi)))
   (setq company-jedi-python-bin "python"))
 (add-to-list 'company-backends 'company-jedi))

(use-package anaconda-mode
  :if (eq window-system 'ns)
  :ensure t
  :defer t
  :bind
   (:map company-active-map)
   ("e" . pythonic-activate)
  :init (add-hook 'python-mode-hook 'anaconda-mode)
	(add-hook 'python-mode-hook 'anaconda-eldoc-mode)
  :config
    ;; (pythonic-activate "~/anaconda3/envs/py37")
    (pythonic-activate "~/anaconda3/envs/ml4t") ;; for class
    (use-package company-anaconda
      :ensure t
      :init (add-hook 'python-mode-hook 'anaconda-mode)
      (eval-after-load "company"
	'(add-to-list 'company-backends '(company-anaconda :with company-capf)))))

(use-package hy-mode
  :ensure t
  :defer t
  :init (add-hook 'hy-mode-hook 'lispyville-mode))

(use-package racket-mode
  :ensure t
  :defer t
  :init
    (add-hook 'racket-mode-hook 'lispyville-mode)
    (if (eq window-system 'w32) (setq racket-program "c:/Program Files/Racket/Racket.exe")))

(use-package writeroom-mode
  :ensure t)

(use-package wc-mode
  :ensure t)

(setq-default ispell-program-name ak/custpath-aspell)

(use-package flycheck
  :init  (setq flymake-run-in-place nil) ;; don't save flymake locally
  :ensure t)

(defun new-eshell ()
  "Open eshell on bottom of screen."
  (interactive)
  (when (one-window-on-screen-p)
    (let* ((lines (window-body-height))
	   (new-window (split-window-vertically (floor (* 0.7 lines)))))
      (select-window new-window)
      (eshell "eshell"))))

(defun one-window-on-screen-p ()
  "Check if there is only one buffer on the screen."
  (= (length (window-list)) 1))

(use-package tramp
  :ensure t
  :defer t
  :init
   (when (eq window-system 'w32)
     (setq tramp-default-method "plink")
     (setenv "PATH" (concat "c:/Program Files/PuTTY/" ";" (getenv "PATH")))))

(use-package expand-region 
  :ensure t)

(use-package which-key
  :ensure t
  :init
  (setq which-key-separator " ")
  (setq which-key-prefix-prefix "+")
  :config
  (which-key-mode 1))
