myinit.org
** General
   General is my key-binding mangagement package. I like to have all of the keys in one place -- rather than trapped in my use-package. Especially with my general keys -- like w/ space.
 #+begin_src emacs-lisp
   (use-package general
     :ensure t
     :config (general-evil-setup) ;; let's me use general-*map keys
	     (general-nvmap
	       ;; replaces C-c with ,
	       "," (general-simulate-key "C-c"))
	     (general-define-key
	       :states '(normal visual)
	       ;; use visual line movement w/ j/k
	       "j" 'evil-next-visual-line
	       "k" 'evil-previous-visual-line
	       ;; globally define 
	       "C-=" 'er/expand-region
	       "<f5>" 'webjump)
	     (general-define-key
	       :states '(normal viusal)
	       :prefix "g"
	       ;; bind gj and gk
	       "j" 'evil-next-line
	       "k" 'evil-previous-line)
	     (general-define-key
	       :states '(normal visual insert emacs)
	       :prefix "SPC"
	       :non-normal-prefix "M-SPC"
	       "/"  '(swiper :which-key "swiper") ; You'll need counsel package for this ;; consider counsel-git-grep
	       "\\"  '(counsel-rg :which-key "ripgrep") ; You'll need counsel package for this ;; consider counsel-git-grep
	       "TAB" '(spacemacs/alternate-window :which-key "alternate buffer")
	       "SPC" '(counsel-M-x :which-key "M-x")
	       "f"   '(:ignore t :which-key "files")
	       "ff"  '(counsel-find-file :which-key "find files")
	       "fr"  '(counsel-recentf :which-key "recent files")
	       "fs"  '(save-buffer :which-key "save buffer")
	       "ft"  '(ak/ivy-tramp-find-file :which-key "find tramp files")
	       "fh"  '(ak/ivy-home-find-file :which-key "find home files")
	       ;;projects
	       "p"   '(:ignore t :which-key "project")
	       "pc"  '(:keymap projectile-command-map :which-key "commands")
	       "pp"  '(projectile-switch-project :which-key "switch project")
	       "pb"  '(counsel-projectile-switch-to-buffer :which-key "find project file")
	       "pf"  '(counsel-projectile-find-file :which-key "find project file")
	       "pg"  '(projectile-grep :which-key "grep project")
	       "pk"  '(projectile-kill-buffers :which-key "kill all buffers in project")
	       ;; eval
	       "e"   '(:ignore t :which-key "evaluate")
	       "ee"  '(eval-last-sexp :which-key "last expression")
	       "eE"  '(eval-expression :which-key "expression")
	       "eb"  '(eval-buffer :which-key "buffer")
	       "er"  '(eval-region :which-key "region")
	       ;; Buffers
	       "b"   '(:ignore t :which-key "buffers")
	       "bb"  '(ivy-switch-buffer :which-key "buffers list")
	       "bs"  '(ak/go-to-scratch :which-key "open scratch")
	       "bn"  '(switch-to-next-buffer :which-key "next buffer")
	       "bp"  '(switch-to-prev-buffer :which-key "prev buffer")
	       "bd"  '(kill-this-buffer :which-key "delete buffer")
	       "bk"  '(evil-delete-buffer :which-key "delete buffer and window")
	       "bq"  '(ak/save-exit-buffer-list :which-key "quit gtd-files")
	       ;; Window
	       "w"   '(:ignore t :which-key "window")
	       "wl"  '(windmove-right :which-key "move right")
	       "wh"  '(windmove-left :which-key "move left")
	       "wk"  '(windmove-up :which-key "move up")
	       "wj"  '(windmove-down :which-key "move bottom")
	       "wL"  '(evil-window-move-far-right :which-key "shift window right")
	       "wH"  '(evil-window-move-far-left :which-key "shift window left")
	       "wK"  '(evil-window-move-very-top :which-key "shift window up")
	       "wJ"  '(evil-window-move-very-bottom :which-key "shift window bottom")
	       "wv"  '(split-window-right :which-key "split right")
	       "ws"  '(split-window-below :which-key "split bottom")
	       "wo"  '(delete-other-windows :which-key "delete other windows")
	       "wd"  '(delete-window :which-key "delete window")
	       "wg"  '(golden-ratio :which-key "golden ratio")
	       "wc"  '(evil-window-delete :which-key "delete window")
	       "wu"  '(winner-undo :which-key "winner undo")
	       "wU"  '(winner-redo :which-key "winner redo")
	       "ww"  '(writeroom-mode :which-key "writeroom mode")
	       ;; v for view
	       "v"   '(:ignore t :which-key "view")
	       "vc"  '(ivy-push-view :which-key "create view")
	       "vv"  '(ivy-switch-view :which-key "switch view")
	       "vs"  '(ak/save-ivy-views :which-key "save views")
	       "vl"  '(ak/load-ivy-views :which-key "load views")
	       ;; Org
	       "o"   '(:ignore t :which-key "org")
	       "ob"  '(ak/insert-bable :Which-key "insert bable")
	       "oo"  '(air-pop-to-org-agenda :which-key "open standard agenda")
	       "or"  '(org-agenda :which-key "open review agenda")
	       "oc"  '(org-capture :which-key "org capture")
	       "oj"  '(org-journal-new-entry :which-key "org journal")
	       "op"  '(org-pomodoro :which-key "pomodoro start")
	       "oP"  '(org-clock-out :which-key "pomodoro stop")
	       ;; git
	       "g"   '(:ignore t :which-key "git")
	       "gs"  '(magit-status :which-key "magit status")
	       "ga"  '(magit-stage :which-key "magit add")
	       "gd"  '(magit-dispatch :which-key "magit dispatch")
	       "gi"  '(magit-gitignore :which-key "magit gitignore")
	       "gn"  '(git-gutter:next-hunk :which-key "next hunk")
	       "gp"  '(git-gutter:previous-hunk :which-key "prev hunk")
	       ;; Visual Toggles
	       "t"   '(:ignore t :which-key "ui toggle")
	       "tn"  '(display-line-numbers-mode :which-key "toggle line numbers")
	       "tL"  '(org-toggle-link-display :which-key "toggle how org links show")
	       "ti"  '(org-toggle-inline-images :which-key "toggle how org links show")
	       "tl"  '(visual-line-mode :which-key "toggle line wrap")
	       "tc"  '(flycheck-mode :which-key "toggle flycheck")
	       "ts"  '(flyspell-mode :which-key "toggle flyspell")
	       "tj"  '(json-pretty-print-buffer :which-key "toggle json pretty-print")
	       ;; Flycheck
	       "c"   '(:ignore t :which-key "code check")
	       "cn"  '(flycheck-next-error :which-key "next error")
	       "cp"  '(flycheck-previous-error :which-key "previous error")
	       ;; Snippets
	       "s"   '(:ignore t :which-key "code check")
	       "ss"  '(yas-insert-snippet :which-key "next error")
	       "sn"  '(yas-new-snippet :which-key "previous error")
	       ;; Others
	       "at"  '(new-eshell :which-key "eshell"))
	     (general-define-key
	       :states '(normal visual insert emacs)
	       :prefix "C-c"
	       ;; Quick open files
	       "c"  '((lambda () (interactive) (find-file (concat ak/custpath-emacsd "myinit.org"))) :which-key "open .emacs")
	       "o"  '((lambda () (interactive) (find-file (concat ak/custpath-org-notes "gtd.org"))) :which-key "open org")
	       "n"  '((lambda () (interactive) (find-file (concat ak/custpath-org-notes "worknotes.org"))) :which-key "open notes")
	       "N"  '((lambda () (interactive) (find-file (concat ak/custpath-dropbox-org "notes.org"))) :which-key "open notes")
	       ;; Vim  number increment
	       "C-="  '(evil-numbers/inc-at-pt :which-key "increment num")
	       "C--"  '(evil-numbers/dec-at-pt :which-key "decrement num"))
	     ;; org agenda (more options here: https://github.com/Somelauw/evil-org-mode/blob/master/evil-org-agenda.el)
	     (general-define-key
		:keymaps 'org-agenda-mode-map
		"j" 'org-agenda-next-line
		"k" 'org-agenda-previous-line
		"u" 'org-agenda-undo
		"n" 'org-agenda-capture
		"p" 'org-pomodoro
		"C" 'org-agenda-clock-in)
	     ;; Org C-c links
	     (general-define-key
		:states '(normal)
		:prefix "C-c"
		:keymaps 'org-mode-map
		"l" 'org-store-link)
	     ;; C-w & C-d conflicted w/ the racket repl. This allows the standard evil bindings for function properly.
	     (general-unbind 'racket-repl-mode-map
		"C-w"
		"C-d")
	     (general-define-key
		:keymaps 'elpy-mode-map
		"C-c d" 'elpy-send-defun
		"C-c C-a" 'elpy-goto-assignment)
	     (general-define-key
		:keymaps 'org-journal-mode-map
		"C-c C-c" 'ak/save-close-window)
	     (general-define-key
		:keymaps 'org-mode-map
		 ;; Org-Promote
		"M-l" 'org-do-demote
		"M-h" 'org-do-promote
		"M-L" 'org-demote-subtree
		"M-H" 'org-promote-subtree
		"M-k" 'org-move-subtree-up
		"M-j" 'org-move-subtree-down
		"C-c f" 'ak/org-focus-subtree
		"C--" 'help/insert-em-dash
		"M--" 'help/insert-en-dash
		"C-M-y" 'insert-char)
	     ;; (general-define-key
	     ;;    :keymaps 'eww-mode-map
	     ;;     ;; Org-Promote
	     ;;    "M-l" 'org-do-demote
	     ;;    "M-h" 'org-do-promote
	     ;;    "M-L" 'org-demote-subtree
	     ;;    "M-H" 'org-promote-subtree
	     ;;    "M-k" 'org-move-subtree-up
	     ;;    "M-j" 'org-move-subtree-down
	     ;;    "C-c f" 'ak/org-focus-subtree
	     ;;    "C--" 'help/insert-em-dash
	     ;;    "M--" 'help/insert-en-dash
	     ;;    "C-M-y" 'insert-char)
	     )
                #+end_src

 #+RESULTS:
 : t

