myinit.el

(defhydra hydra-zoom (global-map "<f2>")
 "zoom"
 ("+" text-scale-increase "in")
 ("-" text-scale-decrease "out"))

(defhydra hydra-winner (global-map "<f2>")
 "Winner"
 ("u" winner-undo "in")
 ("U" winner-redo "out"))

(defhydra hydra-buffer-menu (:color pink
			     :hint nil)
  "
^Mark^             ^Unmark^           ^Actions^          ^Search
^^^^^^^^-----------------------------------------------------------------
_m_: mark          _u_: unmark        _x_: execute       _R_: re-isearch
_s_: save          _U_: unmark up     _b_: bury          _I_: isearch
_d_: delete        ^ ^                _g_: refresh       _O_: multi-occur
_D_: delete up     ^ ^                _T_: files only: % -28`Buffer-menu-files-only
_~_: modified
"
  ("m" Buffer-menu-mark)
  ("u" Buffer-menu-unmark)
  ("U" Buffer-menu-backup-unmark)
  ("d" Buffer-menu-delete)
  ("D" Buffer-menu-delete-backwards)
  ("s" Buffer-menu-save)
  ("~" Buffer-menu-not-modified)
  ("x" Buffer-menu-execute)
  ("b" Buffer-menu-bury)
  ("g" revert-buffer)
  ("T" Buffer-menu-toggle-files-only)
  ("O" Buffer-menu-multi-occur :color blue)
  ("I" Buffer-menu-isearch-buffers :color blue)
  ("R" Buffer-menu-isearch-buffers-regexp :color blue)
  ("c" nil "cancel")
  ("v" Buffer-menu-select "select" :color blue)
  ("o" Buffer-menu-other-window "other-window" :color blue)
  ("q" quit-window "quit" :color blue))
;; (define-key Buffer-menu-mode-map "." 'hydra-buffer-menu/body)

(defun ak/go-to-buffer (buffer)
  "goes to buffer. If buffer does not exist, creates buffer"
  (if (not (get-buffer buffer))
      (generate-new-buffer buffer))
  (switch-to-buffer buffer))

(defun ak/go-to-scratch ()
  "runs ak/go-to-buffer for scratch file"
  (interactive)
  (ak/go-to-buffer "*buffer*"))

(defun spacemacs/alternate-window (&optional window)
  (interactive)
  (let ((current-buffer (window-buffer window)))
    ;; if no window is found in the windows history, `switch-to-buffer' will
    ;; default to calling `other-buffer'
    (switch-to-buffer
     (cl-find-if (lambda (buffer)
		   (not (eq buffer current-buffer)))
		 (mapcar #'car (window-prev-buffers window)))
     nil t)))

(defun ak/insert-bable ()
  "Insert src_sections for viz in orgmode."
  (interactive)
  (insert "#+begin_src "
	  (read-string "Enter Language (R, python, lisp): ")
	  (if (equal (read-string "Return Viz (y/n) ") "y")
	      " :results output graphics :file img.png"
	    ""))
  (insert "\n \n#+end_src"))

(defun ak/ivy-tramp-find-file ()
  "find-file with Tramp. Ex: '/plink:bort:~/'. See tramp note to setup"
  (interactive)
  (let ((tramp-path (concat "/" tramp-default-method ":")))
    (counsel-find-file tramp-path)))

(defun ak/ivy-home-find-file ()
  "open counsel-find-file in the home directory"
  (interactive)
  (counsel-find-file ak/custpath-home))

(defun ak/save-close-window ()
  "save, kill buffer, and kill window of focused file"
  (interactive)
  (save-buffer)
  (kill-buffer)
  (delete-window))

(defun ak/org-focus-subtree ()
  "Toggle org narrow subtreee / show everything"
  (interactive)
  (if (buffer-narrowed-p)
      (widen)
    (org-narrow-to-subtree)))

(setq gtd-buffer-list '("inbox.org" "gtd.org" "gtd.org_archive" "notes.org" "notes.org_archive" "phone_inbox.org")) ;; custpath

(defun ak/delete-buffer-list (buffer)
  "Delete buffer if exists"
  (when (get-buffer buffer)
    (kill-buffer buffer)))

(defun ak/save-exit-buffer-list ()
  "save all buffers in list then close them. Used for keeping gtd from conflicting on multiple machines"
  (interactive)
  (save-some-buffers gtd-buffer-list)
  (mapcar #'ak/delete-buffer-list gtd-buffer-list))

(defun help/insert-em-dash ()
  "Inserts an EM-DASH (not a HYPEN, not an N-DASH)"
  (interactive)
  (insert "¡X"))
(defun help/insert-en-dash ()
  "Inserts an EN-DASH (not a HYPEN, not an EM-DASH)"
  (interactive)
  (insert "¡V"))

(setq gc-cons-threshold (* 2 1000 1000))
)
